from scene import Scene

class IntroScene(Scene):
    def __init__(self, screen, game_settings):
        """Сцена інтро, що успадковує Scene."""
        super().__init__(
            screen=screen,
            duration=40,  # Загальна тривалість сцени
            backgrounds=[
                ("../assets/scene/intro/image1.png", 40),  # 1-й фон (10 сек)
                ("../assets/scene/intro/image2.png", 30),  # 2-й фон (10 сек)
            ],
            texts=[
                ("Важкі часи у країні головного героя. Часи скорботи, часи втрати.", 10),
                ("Але це і часи героїв, часи сміливих, часи дії.", 10),
                ("Темрява згущується, а вітер змін починає свою гру.", 10),
                ("Таємничі сили пробуджуються, а давні пророцтва оживають.", 10),
                ("Світ балансує на краю безодні, і кожен вибір може змінити його долю.", 10),
                ("Десь у тіні чується шепіт – це не просто легенди, це кроки майбутнього.", 10),
                ("Герой ще не знає, що його шлях вже визначено. Чи зможе він змінити написане?", 10)
            ],
            game_settings=game_settings,
            music_file="../assets/scene/intro/intro.mp3"  # Додаємо музику
        )