from scene import Scene

class IntroScene(Scene):
    def __init__(self, screen, game_settings):
        """Сцена інтро, що успадковує Scene."""
        super().__init__(
            screen=screen,
            duration=40,  # Загальна тривалість сцени
            backgrounds=[
                ("../assets/scene/intro/image1.png", 10, 2, 2),
                ("../assets/scene/intro/image2.png", 10, 2, 0.01),
                ("../assets/scene/intro/image3.png", 10, 2, 2),
                ("../assets/scene/intro/image4.png", 10, 1, 4),
            ],
            texts=[
                ("Важкі часи у королівстві головного героя. Часи скорботи, часи втрати.", 2),
                ("Але це і часи героїв, часи сміливих, часи доленосних рішень.", 2),
                ("Темрява згущується над землями стародавніх королів, а вітер змін нашіптує своє пророцтво.", 2),
                ("Таємничі сили пробуджуються, а давні пророцтва оживають на сторінках забутих манускриптів.", 10),
                ("Світ балансує на краю безодні, і кожен вибір здатен похитнути рівновагу.", 10),
                ("Десь у тіні чується шепіт – це не просто легенди, це відлуння грядущої битви.", 10),
                ("Герой ще не знає, що його шлях вже написано кров’ю. Чи здатен він змінити долю?", 10),
                (
                "Зірки згасають, знамення з’являються на небосхилі, і старі боги повертають свій погляд на світ смертних.",
                10),
                ("Мечі куються, армії збираються, а ті, хто колись ховалися в темряві, виходять на світло.", 10),
                (
                "Великий дракон прокидається у своїй кам'яній гробниці, і його рев чути на всіх чотирьох кінцях світу.",
                10),
                ("Забуті руїни ховають таємниці, які не мали бути розкриті. Чи вистачить тобі відваги?", 10),
                ("Магія повертається, і разом із нею – ті, хто її прагне використати для зла.", 10),
                ("Древні роди знову піднімають свої прапори, закликаючи своїх спадкоємців до боротьби.", 10),
                ("Кров на камені, попіл у вітрі – війна вже тут, і відступати нікуди.", 10),
                ("Шлях обраного завжди веде у темряву, але чи зможе він принести світло?", 10),
                ("Відлуння минулого кличе тих, хто здатен його почути. Чи озвешся ти?", 10),
                ("Чарівні ліси більше не мовчать – їх голос чути в снах відважних.", 10)
            ],
            game_settings=game_settings,
            music_file="../assets/scene/intro/intro.mp3"  # Додаємо музику
        )